[
  {
    "id": 0,
    "question": "List all boardgames by GMT.",
    "answers": [
      "http://dbpedia.org/resource/Washington's_War",
      "http://dbpedia.org/resource/Fields_of_Fire_(game)",
      "http://dbpedia.org/resource/Commands_&_Colors:_Ancients",
      "http://dbpedia.org/resource/A_World_At_War",
      "http://dbpedia.org/resource/Sword_of_Rome",
      "http://dbpedia.org/resource/Twilight_Struggle",
      "http://dbpedia.org/resource/Paths_of_Glory_(board_game)",
      "http://dbpedia.org/resource/Chandragupta_(board_game)"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 8,
    "question": "Give me all actors starring in movies directed by and starring William Shatner.",
    "answers": [
      "http://dbpedia.org/resource/Tom_Towles",
      "http://dbpedia.org/resource/Brenda_Bakke",
      "http://dbpedia.org/resource/William_Shatner",
      "http://dbpedia.org/resource/John_Prosky",
      "http://dbpedia.org/resource/Dan_Martin_(actor)",
      "http://dbpedia.org/resource/Duane_Whitaker",
      "http://dbpedia.org/resource/Chuck_Williams_(actor)",
      "http://dbpedia.org/resource/Dick_Van_Patten",
      "http://dbpedia.org/resource/J.T._Colosa",
      "http://dbpedia.org/resource/Dan_Gauthier",
      "http://dbpedia.org/resource/Amy_Acker",
      "http://dbpedia.org/resource/Rickey_Medlocke"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 12,
    "question": "Give me the grandchildren of Bruce Lee.",
    "answers": [
      "1"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri }",
    "answertype": "number",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 19,
    "question": "Give me the Apollo 14 astronauts.",
    "answers": [
      "http://dbpedia.org/resource/Stuart_Roosa",
      "http://dbpedia.org/resource/Alan_Shepard",
      "http://dbpedia.org/resource/Edgar_Mitchell"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 23,
    "question": "Give me a list of all trumpet players that were bandleaders.",
    "answers": [
      "http://dbpedia.org/resource/Terumasa_Hino",
      "http://dbpedia.org/resource/Adam_Taubitz",
      "http://dbpedia.org/resource/Jacobo_Rubalcaba",
      "http://dbpedia.org/resource/Jimmy_Dorsey",
      "http://dbpedia.org/resource/Pacho_Galan",
      "http://dbpedia.org/resource/Abatte_Barihun",
      "http://dbpedia.org/resource/Jimmy_Vivino",
      "http://dbpedia.org/resource/Billie_Rogers",
      "http://dbpedia.org/resource/Lloyd_Hunter",
      "http://dbpedia.org/resource/Hot_Lips_Page",
      "http://dbpedia.org/resource/Wayne_Bergeron",
      "http://dbpedia.org/resource/Clifford_Thornton",
      "http://dbpedia.org/resource/Richard_Maltby,_Sr.",
      "http://dbpedia.org/resource/Doc_Cheatham",
      "http://dbpedia.org/resource/Ovie_Alston",
      "http://dbpedia.org/resource/Pete_Brown_(jazz_musician)",
      "http://dbpedia.org/resource/Don_Albert",
      "http://dbpedia.org/resource/Bobby_Hackett",
      "http://dbpedia.org/resource/Charlie_Spivak",
      "http://dbpedia.org/resource/Guy_Barker",
      "http://dbpedia.org/resource/Neil_Yates",
      "http://dbpedia.org/resource/Louis_Prima",
      "http://dbpedia.org/resource/Gerald_Wilson",
      "http://dbpedia.org/resource/Willie_Mitchell_(musician)",
      "http://dbpedia.org/resource/Orbert_Davis",
      "http://dbpedia.org/resource/Sean_Jones_(trumpeter)",
      "http://dbpedia.org/resource/Henry_Jerome",
      "http://dbpedia.org/resource/Brad_Turner_(musician)",
      "http://dbpedia.org/resource/Ollie_Mitchell",
      "http://dbpedia.org/resource/Artie_Fields",
      "http://dbpedia.org/resource/Ernest_%22Doc%22_Paulin",
      "http://dbpedia.org/resource/Mark_Masters_(musician)",
      "http://dbpedia.org/resource/Erskine_Hawkins",
      "http://dbpedia.org/resource/Jack_Jackson_(British_radio)",
      "http://dbpedia.org/resource/Gerard_Presencer",
      "http://dbpedia.org/resource/Joe_Wilder",
      "http://dbpedia.org/resource/Doc_Severinsen",
      "http://dbpedia.org/resource/Alan_Silva",
      "http://dbpedia.org/resource/Red_Perkins",
      "http://dbpedia.org/resource/Wingy_Manone",
      "http://dbpedia.org/resource/Cleveland_Eaton",
      "http://dbpedia.org/resource/Papa_Celestin",
      "http://dbpedia.org/resource/Danny_Davis_(country_musician)",
      "http://dbpedia.org/resource/Maynard_Ferguson",
      "http://dbpedia.org/resource/Theodore_Carpenter",
      "http://dbpedia.org/resource/Marlon_Jordan"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 39,
    "question": "Give all swimmers that were born in Moscow.",
    "answers": [
      "http://dbpedia.org/resource/Irena_Olevsky",
      "http://dbpedia.org/resource/Yevgeny_Novikov",
      "http://dbpedia.org/resource/Nikolai_Pankin",
      "http://dbpedia.org/resource/Sergey_Lavrenov",
      "http://dbpedia.org/resource/Igor_Grivennikov",
      "http://dbpedia.org/resource/Artem_Lobuzov",
      "http://dbpedia.org/resource/Svetlana_Chimrova",
      "http://dbpedia.org/resource/Vladimir_Shuvalov",
      "http://dbpedia.org/resource/Valentina_Tutayeva",
      "http://dbpedia.org/resource/Viktor_Mazanov",
      "http://dbpedia.org/resource/Valentin_Kuzmin",
      "http://dbpedia.org/resource/Semyon_Belits-Geiman",
      "http://dbpedia.org/resource/Stanislava_Komarova",
      "http://dbpedia.org/resource/Marina_Kosheveya",
      "http://dbpedia.org/resource/Anastasia_Chaun",
      "http://dbpedia.org/resource/Vladimir_Minashkin",
      "http://dbpedia.org/resource/Gelena_Topilina",
      "http://dbpedia.org/resource/Irina_Grazhdanova",
      "http://dbpedia.org/resource/Anisya_Olkhova",
      "http://dbpedia.org/resource/Pyotr_Skripchenkov",
      "http://dbpedia.org/resource/Viktor_Drobinsky",
      "http://dbpedia.org/resource/Olesya_Vladykina",
      "http://dbpedia.org/resource/Yevgeny_Korotyshkin",
      "http://dbpedia.org/resource/Irina_Pozdnyakova",
      "http://dbpedia.org/resource/Elena_Prokofyeva",
      "http://dbpedia.org/resource/Aleksandr_Pletnev",
      "http://dbpedia.org/resource/Irina_Abysova",
      "http://dbpedia.org/resource/Alexey_Zinovyev",
      "http://dbpedia.org/resource/Danil_Haustov",
      "http://dbpedia.org/resource/Svetlana_Romashina",
      "http://dbpedia.org/resource/Mikhail_Polischuk",
      "http://dbpedia.org/resource/Maria_Shurochkina",
      "http://dbpedia.org/resource/Aleksandr_Samsonov",
      "http://dbpedia.org/resource/Anastasia_Davydova",
      "http://dbpedia.org/resource/Nina_Petrova",
      "http://dbpedia.org/resource/Alla_Shishkina",
      "http://dbpedia.org/resource/Elena_Sokolova_(swimmer)",
      "http://dbpedia.org/resource/Andrey_Dunayev",
      "http://dbpedia.org/resource/Alla_Grebennikova",
      "http://dbpedia.org/resource/Aleksandr_Paramonov",
      "http://dbpedia.org/resource/Marina_Chepurkova",
      "http://dbpedia.org/resource/Alexandra_Patskevich",
      "http://dbpedia.org/resource/Oleg_Fotin",
      "http://dbpedia.org/resource/Yekaterina_Vinogradova",
      "http://dbpedia.org/resource/Rozaliya_Nasretdinova",
      "http://dbpedia.org/resource/Anastasia_Diodorova",
      "http://dbpedia.org/resource/Viktor_Sharygin",
      "http://dbpedia.org/resource/Aleksandr_Fedorovsky",
      "http://dbpedia.org/resource/Marina_Shamal",
      "http://dbpedia.org/resource/Valentina_Poznyak",
      "http://dbpedia.org/resource/Vladimir_Kravchenko",
      "http://dbpedia.org/resource/Viktor_Konoplyov_(swimmer)",
      "http://dbpedia.org/resource/Mariya_Gromova",
      "http://dbpedia.org/resource/Aleksey_Kudryavtsev",
      "http://dbpedia.org/resource/Vladislav_Kulikov",
      "http://dbpedia.org/resource/Anton_Chupkov",
      "http://dbpedia.org/resource/Andrey_Krylov_(swimmer_born_1984)",
      "http://dbpedia.org/resource/Elvira_Khasyanova",
      "http://dbpedia.org/resource/Darina_Valitova",
      "http://dbpedia.org/resource/Nikolay_Suhorukov",
      "http://dbpedia.org/resource/Tamara_Sosnova",
      "http://dbpedia.org/resource/Anastasia_Gloushkov",
      "http://dbpedia.org/resource/Daniela_In\u00e1cio",
      "http://dbpedia.org/resource/Maria_Gromova_(swimmer)",
      "http://dbpedia.org/resource/Olga_Sedakova_(synchronised_swimmer)"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 45,
    "question": "Show a list of soccer clubs that play in the Bundesliga.",
    "answers": [
      "http://dbpedia.org/resource/Borussia_M\u00f6nchengladbach",
      "http://dbpedia.org/resource/SV_Darmstadt_98",
      "http://dbpedia.org/resource/FC_Augsburg",
      "http://dbpedia.org/resource/Bayer_04_Leverkusen",
      "http://dbpedia.org/resource/VfL_Wolfsburg",
      "http://dbpedia.org/resource/FC_Ingolstadt_04",
      "http://dbpedia.org/resource/Eintracht_Frankfurt",
      "http://dbpedia.org/resource/SC_Freiburg",
      "http://dbpedia.org/resource/Hertha_BSC",
      "http://dbpedia.org/resource/1._FC_K\u00f6ln",
      "http://dbpedia.org/resource/SV_Werder_Bremen",
      "http://dbpedia.org/resource/1._FSV_Mainz_05",
      "http://dbpedia.org/resource/FC_Schalke_04",
      "http://dbpedia.org/resource/RB_Leipzig",
      "http://dbpedia.org/resource/TSG_1899_Hoffenheim",
      "http://dbpedia.org/resource/FC_Bayern_Munich",
      "http://dbpedia.org/resource/Borussia_Dortmund",
      "http://dbpedia.org/resource/Hamburger_SV"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 54,
    "question": "Give me the capitals of all countries that the Himalayas run through.",
    "answers": [
      "http://dbpedia.org/resource/Thimphu"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 58,
    "question": "Give me all islands that belong to Japan.",
    "answers": [
      "http://dbpedia.org/resource/Iwo_Jima",
      "http://dbpedia.org/resource/Jinai-t\u014d",
      "http://dbpedia.org/resource/Kuroshima_(Kagoshima)",
      "http://dbpedia.org/resource/Kyushu",
      "http://dbpedia.org/resource/Oki_Islands",
      "http://dbpedia.org/resource/Ishigaki_Island",
      "http://dbpedia.org/resource/Hachij\u014d-kojima",
      "http://dbpedia.org/resource/Yokoate-jima",
      "http://dbpedia.org/resource/Bayonnaise_Rocks",
      "http://dbpedia.org/resource/Tokara_Islands",
      "http://dbpedia.org/resource/Miyake-jima",
      "http://dbpedia.org/resource/Kamome_Island",
      "http://dbpedia.org/resource/Inamba-jima",
      "http://dbpedia.org/resource/Izu_\u014cshima",
      "http://dbpedia.org/resource/Chichijima",
      "http://dbpedia.org/resource/\u014cnohara_Islands",
      "http://dbpedia.org/resource/\u014csumi_Islands",
      "http://dbpedia.org/resource/Zamami_Island",
      "http://dbpedia.org/resource/Kogajajima",
      "http://dbpedia.org/resource/Sh\u014dwa_I\u014djima",
      "http://dbpedia.org/resource/Kitadait\u014djima",
      "http://dbpedia.org/resource/Akusekijima",
      "http://dbpedia.org/resource/Udone-shima",
      "http://dbpedia.org/resource/Fukaji_Island",
      "http://dbpedia.org/resource/Kinkasan",
      "http://dbpedia.org/resource/Rebun_Island",
      "http://dbpedia.org/resource/Tsuken_Island",
      "http://dbpedia.org/resource/Benten-jima_(Wakkanai)",
      "http://dbpedia.org/resource/Oshima_(Hokkaido)",
      "http://dbpedia.org/resource/Hokkaido",
      "http://dbpedia.org/resource/Okinotorishima",
      "http://dbpedia.org/resource/Taketomi_Island",
      "http://dbpedia.org/resource/Daikon_Island",
      "http://dbpedia.org/resource/Amami_\u014cshima",
      "http://dbpedia.org/resource/Genkai_Island",
      "http://dbpedia.org/resource/Hateruma",
      "http://dbpedia.org/resource/Izena_Island",
      "http://dbpedia.org/resource/Nii_\u014cshima",
      "http://dbpedia.org/resource/Aka_Island",
      "http://dbpedia.org/resource/Geruma_Island",
      "http://dbpedia.org/resource/Yaeyama_Islands",
      "http://dbpedia.org/resource/Iejima",
      "http://dbpedia.org/resource/Iriomote-jima",
      "http://dbpedia.org/resource/Kuchinoerabu-jima",
      "http://dbpedia.org/resource/Hashima_Island",
      "http://dbpedia.org/resource/Tokashiki_Island",
      "http://dbpedia.org/resource/Takeshima_(Kagoshima)",
      "http://dbpedia.org/resource/Hatsushima",
      "http://dbpedia.org/resource/Tanegashima",
      "http://dbpedia.org/resource/Amami_Islands",
      "http://dbpedia.org/resource/Tobishima_(Yamagata)",
      "http://dbpedia.org/resource/Hokkaido__island__1",
      "http://dbpedia.org/resource/Tori-shima_(Izu_Islands)",
      "http://dbpedia.org/resource/Nakadori_Island",
      "http://dbpedia.org/resource/Denshima",
      "http://dbpedia.org/resource/Yagishiri_Island",
      "http://dbpedia.org/resource/Okushiri_Island",
      "http://dbpedia.org/resource/Awaji_Island",
      "http://dbpedia.org/resource/Volcano_Islands",
      "http://dbpedia.org/resource/Okamura_Island",
      "http://dbpedia.org/resource/Kume_Island",
      "http://dbpedia.org/resource/Mainland_Japan",
      "http://dbpedia.org/resource/Kojima_(Hokkaido)",
      "http://dbpedia.org/resource/Tairajima",
      "http://dbpedia.org/resource/Rishiri_Island",
      "http://dbpedia.org/resource/Nakanoshima_(Kagoshima)",
      "http://dbpedia.org/resource/Miyako-jima",
      "http://dbpedia.org/resource/Ainoshima_(Shing\u016b)",
      "http://dbpedia.org/resource/Gajajima",
      "http://dbpedia.org/resource/Tsushima_Island",
      "http://dbpedia.org/resource/Manabeshima",
      "http://dbpedia.org/resource/Yakushima",
      "http://dbpedia.org/resource/Kozukumi_Island",
      "http://dbpedia.org/resource/Minamidait\u014djima",
      "http://dbpedia.org/resource/Dait\u014d_Islands",
      "http://dbpedia.org/resource/Teuri_Island",
      "http://dbpedia.org/resource/Iki_Island",
      "http://dbpedia.org/resource/Yonaguni",
      "http://dbpedia.org/resource/Smith_Island_(Japan)",
      "http://dbpedia.org/resource/Honshu",
      "http://dbpedia.org/resource/Mageshima",
      "http://dbpedia.org/resource/Shikoku",
      "http://dbpedia.org/resource/Hahajima",
      "http://dbpedia.org/resource/Okidait\u014djima",
      "http://dbpedia.org/resource/Minami-Tori-shima",
      "http://dbpedia.org/resource/I\u014djima_(Kagoshima)",
      "http://dbpedia.org/resource/Lot's_Wife_(crag)",
      "http://dbpedia.org/resource/Okinawa_Island"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 60,
    "question": "Give me all Apollo 14 astronauts.",
    "answers": [
      "http://dbpedia.org/resource/Stuart_Roosa",
      "http://dbpedia.org/resource/Alan_Shepard",
      "http://dbpedia.org/resource/Edgar_Mitchell"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 63,
    "question": "Give me all soccer clubs in the Premier League.",
    "answers": [
      "http://dbpedia.org/resource/2012\u201313_Arsenal_F.C._season",
      "http://dbpedia.org/resource/2014\u201315_Chelsea_F.C._season",
      "http://dbpedia.org/resource/2013\u201314_Chelsea_F.C._season",
      "http://dbpedia.org/resource/2010\u201311_Birmingham_City_F.C._season",
      "http://dbpedia.org/resource/2013\u201314_Arsenal_F.C._season",
      "http://dbpedia.org/resource/2007\u201308_Wigan_Athletic_F.C._season",
      "http://dbpedia.org/resource/2007\u201308_Chelsea_F.C._season",
      "http://dbpedia.org/resource/2007\u201308_Manchester_City_F.C._season",
      "http://dbpedia.org/resource/2008\u201309_Manchester_City_F.C._season",
      "http://dbpedia.org/resource/2011\u201312_Chelsea_F.C._season",
      "http://dbpedia.org/resource/2010\u201311_Arsenal_F.C._season",
      "http://dbpedia.org/resource/2014\u201315_Southampton_F.C._season",
      "http://dbpedia.org/resource/2015\u201316_Southampton_F.C._season",
      "http://dbpedia.org/resource/2008\u201309_Arsenal_F.C._season",
      "http://dbpedia.org/resource/2006\u201307_Reading_F.C._season",
      "http://dbpedia.org/resource/2012\u201313_Chelsea_F.C._season",
      "http://dbpedia.org/resource/2012\u201313_Reading_F.C._season",
      "http://dbpedia.org/resource/2009\u201310_Arsenal_F.C._season",
      "http://dbpedia.org/resource/2006\u201307_Bolton_Wanderers_F.C._season",
      "http://dbpedia.org/resource/2013\u201314_Cardiff_City_F.C._season",
      "http://dbpedia.org/resource/2005\u201306_Wigan_Athletic_F.C._season"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 72,
    "question": "Give me all ESA astronauts.",
    "answers": [
      "http://dbpedia.org/resource/Dirk_Frimout"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 85,
    "question": "Give me all actors who were born in Berlin.",
    "answers": [
      "http://dbpedia.org/resource/Dru_Berrymore",
      "http://dbpedia.org/resource/Tyra_Misoux"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 86,
    "question": "Who created Goofy?",
    "answers": [
      "http://dbpedia.org/resource/Frank_Webb_(cartoonist)",
      "http://dbpedia.org/resource/Walt_Disney",
      "http://dbpedia.org/resource/Paul_Murry"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 90,
    "question": "Give me all the TV shows with Neil Patrick Harris.",
    "answers": [
      "http://dbpedia.org/resource/Capitol_Critters",
      "http://dbpedia.org/resource/Doogie_Howser,_M.D.",
      "http://dbpedia.org/resource/A_Series_of_Unfortunate_Events_(TV_series)",
      "http://dbpedia.org/resource/Dr._Horrible's_Sing-Along_Blog",
      "http://dbpedia.org/resource/Robot_Chicken_DC_Comics_Special",
      "http://dbpedia.org/resource/Neil's_Puppet_Dreams",
      "http://dbpedia.org/resource/Snowbound:_The_Jim_and_Jennifer_Stolpa_Story",
      "http://dbpedia.org/resource/How_I_Met_Your_Mother",
      "http://dbpedia.org/resource/Joan_of_Arc_(miniseries)",
      "http://dbpedia.org/resource/Stark_Raving_Mad_(TV_series)",
      "http://dbpedia.org/resource/Too_Good_to_Be_True_(film)",
      "http://dbpedia.org/resource/The_Christmas_Blessing"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 93,
    "question": "Give me all Swedish holidays.",
    "answers": [
      "http://dbpedia.org/resource/Gustavus_Adolphus_Day",
      "http://dbpedia.org/resource/Veterans_Day_(Sweden)",
      "http://dbpedia.org/resource/St._Knut's_Day",
      "http://dbpedia.org/resource/Christmas_tree_plundering"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 95,
    "question": "List all the musicals with music by Leonard Bernstein.",
    "answers": [
      "http://dbpedia.org/resource/Wonderful_Town",
      "http://dbpedia.org/resource/Candide_(operetta)",
      "http://dbpedia.org/resource/The_Race_to_Urga",
      "http://dbpedia.org/resource/1600_Pennsylvania_Avenue_(musical)",
      "http://dbpedia.org/resource/On_the_Town_(musical)",
      "http://dbpedia.org/resource/West_Side_Story",
      "http://dbpedia.org/resource/A_Party_with_Betty_Comden_and_Adolph_Green",
      "http://dbpedia.org/resource/Side_by_Side_by_Sondheim"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 102,
    "question": "Give me all types of eating disorders.",
    "answers": [
      "http://dbpedia.org/resource/Ingestive_behaviors",
      "http://dbpedia.org/resource/Inedia",
      "http://dbpedia.org/resource/Body_Attitudes_Questionnaire",
      "http://dbpedia.org/resource/Eating_Disorder_Inventory",
      "http://dbpedia.org/resource/Eating_Attitudes_Test",
      "http://dbpedia.org/resource/Wintergirls",
      "http://dbpedia.org/resource/Trichophagia",
      "http://dbpedia.org/resource/Pica_(disorder)",
      "http://dbpedia.org/resource/Avoidant/restrictive_food_intake_disorder",
      "http://dbpedia.org/resource/Feeding_disorder",
      "http://dbpedia.org/resource/Bulimia_nervosa",
      "http://dbpedia.org/resource/Phagophobia",
      "http://dbpedia.org/resource/Body_Attitudes_Test",
      "http://dbpedia.org/resource/Minnesota_Eating_Behavior_Survey",
      "http://dbpedia.org/resource/Rumination_syndrome",
      "http://dbpedia.org/resource/Eating_Disorder_Diagnostic_Scale",
      "http://dbpedia.org/resource/Anorexia_(symptom)",
      "http://dbpedia.org/resource/Food_issue",
      "http://dbpedia.org/resource/Refeeding_syndrome",
      "http://dbpedia.org/resource/Polyphagia",
      "http://dbpedia.org/resource/Pro-ana",
      "http://dbpedia.org/resource/Night_eating_syndrome",
      "http://dbpedia.org/resource/Fat_Phobia_Scale",
      "http://dbpedia.org/resource/Defensive_vomiting",
      "http://dbpedia.org/resource/Binge_Eating_Scale",
      "http://dbpedia.org/resource/Muscle_dysmorphia",
      "http://dbpedia.org/resource/Fat_Chance_(Lesl\u00e9a_Newman_novel)",
      "http://dbpedia.org/resource/Dermatophagia",
      "http://dbpedia.org/resource/Pagophagy",
      "http://dbpedia.org/resource/Eating_mucus",
      "http://dbpedia.org/resource/Purging_disorder",
      "http://dbpedia.org/resource/Mirror_box",
      "http://dbpedia.org/resource/Anorexia_nervosa_(differential_diagnoses)",
      "http://dbpedia.org/resource/Binge_eating",
      "http://dbpedia.org/resource/List_of_phobias",
      "http://dbpedia.org/resource/Russell's_sign",
      "http://dbpedia.org/resource/Food_Addicts_Anonymous",
      "http://dbpedia.org/resource/Disordered_eating",
      "http://dbpedia.org/resource/Bulimia_Test-Revised",
      "http://dbpedia.org/resource/Drunkorexia",
      "http://dbpedia.org/resource/Cognitive_behavioral_treatment_of_eating_disorders",
      "http://dbpedia.org/resource/Diabulimia",
      "http://dbpedia.org/resource/Eating_Disorder_Examination_Interview",
      "http://dbpedia.org/resource/Anorexia_mirabilis",
      "http://dbpedia.org/resource/Three-Factor_Eating_Questionnaire",
      "http://dbpedia.org/resource/Body_Gossip",
      "http://dbpedia.org/resource/Eating_recovery",
      "http://dbpedia.org/resource/Anorectic_Behavior_Observation_Scale",
      "http://dbpedia.org/resource/Exercise_bulimia",
      "http://dbpedia.org/resource/Hypergymnasia",
      "http://dbpedia.org/resource/SCOFF_questionnaire",
      "http://dbpedia.org/resource/Pagophagia",
      "http://dbpedia.org/resource/Food_addiction",
      "http://dbpedia.org/resource/Killing_Aurora",
      "http://dbpedia.org/resource/Primary_polydipsia",
      "http://dbpedia.org/resource/Binge_eating_disorder",
      "http://dbpedia.org/resource/Eating_disorder_not_otherwise_specified",
      "http://dbpedia.org/resource/Orthorexia_nervosa",
      "http://dbpedia.org/resource/Opsophagos",
      "http://dbpedia.org/resource/Wannarexia",
      "http://dbpedia.org/resource/Food_Addicts_in_Recovery_Anonymous",
      "http://dbpedia.org/resource/Nocturnal_sleep-related_eating_disorder",
      "http://dbpedia.org/resource/Other_specified_feeding_or_eating_disorder"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": false,
    "hybrid": false
  },
  {
    "id": 108,
    "question": "Give me all books written by Danielle Steel.",
    "answers": [
      "http://dbpedia.org/resource/Thurston_House_(novel)",
      "http://dbpedia.org/resource/Message_from_Nam",
      "http://dbpedia.org/resource/Daddy_(novel)",
      "http://dbpedia.org/resource/Toxic_Bachelors",
      "http://dbpedia.org/resource/The_House_(novel)",
      "http://dbpedia.org/resource/Five_Days_in_Paris",
      "http://dbpedia.org/resource/H.R.H._(novel)",
      "http://dbpedia.org/resource/Passion's_Promise",
      "http://dbpedia.org/resource/Honor_Thyself",
      "http://dbpedia.org/resource/A_Good_Woman_(novel)",
      "http://dbpedia.org/resource/Amazing_Grace_(novel)",
      "http://dbpedia.org/resource/Betrayal_(Steel_novel)",
      "http://dbpedia.org/resource/A_Perfect_Stranger",
      "http://dbpedia.org/resource/Fine_Things",
      "http://dbpedia.org/resource/Matters_of_the_Heart_(novel)",
      "http://dbpedia.org/resource/Zoya_(novel)",
      "http://dbpedia.org/resource/Miracle_(novel)",
      "http://dbpedia.org/resource/Big_Girl_(novel)",
      "http://dbpedia.org/resource/Coming_Out_(novel)",
      "http://dbpedia.org/resource/Silent_Honor",
      "http://dbpedia.org/resource/Accident_(novel)",
      "http://dbpedia.org/resource/Season_of_Passion",
      "http://dbpedia.org/resource/Ransom_(Steel_novel)",
      "http://dbpedia.org/resource/Mixed_Blessings_(novel)",
      "http://dbpedia.org/resource/Jewels_(novel)",
      "http://dbpedia.org/resource/Southern_Lights_(novel)",
      "http://dbpedia.org/resource/Wanderlust_(Steel_novel)",
      "http://dbpedia.org/resource/Full_Circle_(novel)",
      "http://dbpedia.org/resource/One_Day_at_a_Time_(novel)",
      "http://dbpedia.org/resource/Sunset_in_St._Tropez",
      "http://dbpedia.org/resource/Echoes_(Steel_novel)",
      "http://dbpedia.org/resource/The_Gift_(Steel_novel)",
      "http://dbpedia.org/resource/Crossings_(Steel_novel)",
      "http://dbpedia.org/resource/No_Greater_Love_(novel)",
      "http://dbpedia.org/resource/Impossible_(novel)",
      "http://dbpedia.org/resource/Second_Chance_(Steel_novel)",
      "http://dbpedia.org/resource/Special_Delivery_(novel)",
      "http://dbpedia.org/resource/Family_Album_(novel)",
      "http://dbpedia.org/resource/Now_and_Forever_(novel)",
      "http://dbpedia.org/resource/Rogue_(novel)",
      "http://dbpedia.org/resource/Hotel_Vendome_(novel)",
      "http://dbpedia.org/resource/Friends_Forever_(novel)",
      "http://dbpedia.org/resource/Safe_Harbour_(novel)",
      "http://dbpedia.org/resource/Kaleidoscope_(novel)",
      "http://dbpedia.org/resource/Sisters_(Steel_novel)",
      "http://dbpedia.org/resource/Bungalow_2",
      "http://dbpedia.org/resource/Family_Ties_(novel)"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 140,
    "question": "Give me the birthdays of all actors of the television show Charmed.",
    "answers": [
      "1973-9-5",
      "1971-4-12",
      "1971-01-26",
      "1968-07-27",
      "1985-11-30",
      "1973-6-15",
      "1971-1-26",
      "1969-2-1",
      "1968-7-27",
      "1973-09-05",
      "1973-06-15",
      "1969-02-01",
      "1980-5-19",
      "1971-04-12",
      "1973-12-03",
      "1973-12-3",
      "1980-05-19",
      "1972-12-19"
    ],
    "sparql_query": "SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date }",
    "answertype": "date",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  }
]