[
  {
    "id": 157,
    "question": "List all episodes of the first season of the HBO television series The Sopranos!",
    "answers": [
      "http://dbpedia.org/resource/Isabella_(The_Sopranos)",
      "http://dbpedia.org/resource/Meadowlands_(The_Sopranos)",
      "http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano",
      "http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti",
      "http://dbpedia.org/resource/Boca_(The_Sopranos)",
      "http://dbpedia.org/resource/Nobody_Knows_Anything",
      "http://dbpedia.org/resource/Pax_Soprana",
      "http://dbpedia.org/resource/A_Hit_Is_a_Hit",
      "http://dbpedia.org/resource/Denial,_Anger,_Acceptance",
      "http://dbpedia.org/resource/College_(The_Sopranos)",
      "http://dbpedia.org/resource/46_Long",
      "http://dbpedia.org/resource/The_Sopranos_(episode)",
      "http://dbpedia.org/resource/Down_Neck"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 163,
    "question": "Give me a list of all bandleaders that play trumpet.",
    "answers": [
      "http://dbpedia.org/resource/Terumasa_Hino",
      "http://dbpedia.org/resource/Adam_Taubitz",
      "http://dbpedia.org/resource/Jacobo_Rubalcaba",
      "http://dbpedia.org/resource/Jimmy_Dorsey",
      "http://dbpedia.org/resource/Pacho_Galan",
      "http://dbpedia.org/resource/Abatte_Barihun",
      "http://dbpedia.org/resource/Jimmy_Vivino",
      "http://dbpedia.org/resource/Billie_Rogers",
      "http://dbpedia.org/resource/Lloyd_Hunter",
      "http://dbpedia.org/resource/Hot_Lips_Page",
      "http://dbpedia.org/resource/Wayne_Bergeron",
      "http://dbpedia.org/resource/Clifford_Thornton",
      "http://dbpedia.org/resource/Richard_Maltby,_Sr.",
      "http://dbpedia.org/resource/Doc_Cheatham",
      "http://dbpedia.org/resource/Ovie_Alston",
      "http://dbpedia.org/resource/Pete_Brown_(jazz_musician)",
      "http://dbpedia.org/resource/Don_Albert",
      "http://dbpedia.org/resource/Bobby_Hackett",
      "http://dbpedia.org/resource/Charlie_Spivak",
      "http://dbpedia.org/resource/Guy_Barker",
      "http://dbpedia.org/resource/Neil_Yates",
      "http://dbpedia.org/resource/Louis_Prima",
      "http://dbpedia.org/resource/Gerald_Wilson",
      "http://dbpedia.org/resource/Willie_Mitchell_(musician)",
      "http://dbpedia.org/resource/Orbert_Davis",
      "http://dbpedia.org/resource/Sean_Jones_(trumpeter)",
      "http://dbpedia.org/resource/Henry_Jerome",
      "http://dbpedia.org/resource/Brad_Turner_(musician)",
      "http://dbpedia.org/resource/Ollie_Mitchell",
      "http://dbpedia.org/resource/Artie_Fields",
      "http://dbpedia.org/resource/Ernest_%22Doc%22_Paulin",
      "http://dbpedia.org/resource/Mark_Masters_(musician)",
      "http://dbpedia.org/resource/Erskine_Hawkins",
      "http://dbpedia.org/resource/Jack_Jackson_(British_radio)",
      "http://dbpedia.org/resource/Gerard_Presencer",
      "http://dbpedia.org/resource/Joe_Wilder",
      "http://dbpedia.org/resource/Doc_Severinsen",
      "http://dbpedia.org/resource/Alan_Silva",
      "http://dbpedia.org/resource/Red_Perkins",
      "http://dbpedia.org/resource/Wingy_Manone",
      "http://dbpedia.org/resource/Cleveland_Eaton",
      "http://dbpedia.org/resource/Papa_Celestin",
      "http://dbpedia.org/resource/Danny_Davis_(country_musician)",
      "http://dbpedia.org/resource/Maynard_Ferguson",
      "http://dbpedia.org/resource/Theodore_Carpenter",
      "http://dbpedia.org/resource/Marlon_Jordan"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 170,
    "question": "Give me all movies with Tom Cruise.",
    "answers": [
      "http://dbpedia.org/resource/All_the_Right_Moves_(film)",
      "http://dbpedia.org/resource/Collateral_(film)",
      "http://dbpedia.org/resource/Interview_with_the_Vampire_(film)",
      "http://dbpedia.org/resource/The_Outsiders_(film)",
      "http://dbpedia.org/resource/Far_and_Away",
      "http://dbpedia.org/resource/The_Last_Samurai",
      "http://dbpedia.org/resource/Top_Gun",
      "http://dbpedia.org/resource/Risky_Business",
      "http://dbpedia.org/resource/A_Few_Good_Men",
      "http://dbpedia.org/resource/The_Color_of_Money",
      "http://dbpedia.org/resource/The_Mummy_(2017_film)",
      "http://dbpedia.org/resource/Jerry_Maguire",
      "http://dbpedia.org/resource/Legend_(1985_film)",
      "http://dbpedia.org/resource/Vanilla_Sky",
      "http://dbpedia.org/resource/Valkyrie_(film)",
      "http://dbpedia.org/resource/Knight_and_Day",
      "http://dbpedia.org/resource/Lions_for_Lambs",
      "http://dbpedia.org/resource/Mission:_Impossible_(film_series)",
      "http://dbpedia.org/resource/Cocktail_(1988_film)",
      "http://dbpedia.org/resource/Mission:_Impossible_(film)",
      "http://dbpedia.org/resource/Born_on_the_Fourth_of_July_(film)",
      "http://dbpedia.org/resource/Magnolia_(film)",
      "http://dbpedia.org/resource/The_Firm_(1993_film)",
      "http://dbpedia.org/resource/Minority_Report_(film)",
      "http://dbpedia.org/resource/Rain_Man",
      "http://dbpedia.org/resource/Losin'_It"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 172,
    "question": "Give me all cities in New Jersey with more than 100000 inhabitants.",
    "answers": [
      "http://dbpedia.org/resource/Newark,_New_Jersey",
      "http://dbpedia.org/resource/Jersey_City,_New_Jersey",
      "http://dbpedia.org/resource/Elizabeth,_New_Jersey",
      "http://dbpedia.org/resource/Paterson,_New_Jersey"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 174,
    "question": "Give me all B-sides of the Ramones.",
    "answers": [
      "\"No-One Could Ever Love You More\" (Norway)",
      "\"Babysitter\"",
      "Censorshit",
      "\"I Don't Care\"",
      "\"Go Home Ann\" (12\" only)",
      "\"Gee Girl\"",
      "\"Miss Joan And Mr. Sam\"",
      "\"Do You Wanna Dance?\"",
      "\"California Sun\" / \"I Dont Wanna Walk Around With You\" (live)",
      "\"Daytime Dilemma (Dangers of Love)\"",
      "\"Saturday Night Out\""
    ],
    "sparql_query": "SELECT DISTINCT ?string WHERE { ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/bSide> ?string }",
    "answertype": "string",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 177,
    "question": "List the seven kings of Rome.",
    "answers": [
      "http://dbpedia.org/resource/Tullus_Hostilius",
      "http://dbpedia.org/resource/Lucius_Tarquinius_Superbus",
      "http://dbpedia.org/resource/Servius_Tullius",
      "http://dbpedia.org/resource/Ancus_Marcius",
      "http://dbpedia.org/resource/Romulus_and_Remus",
      "http://dbpedia.org/resource/Numa_Pompilius",
      "http://dbpedia.org/resource/Lucius_Tarquinius_Priscus"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 178,
    "question": "Give me all people that were born in Vienna and died in Berlin.",
    "answers": [
      "http://dbpedia.org/resource/Michael_von_Newlinsky",
      "http://dbpedia.org/resource/John_Reinhardt_(director)",
      "http://dbpedia.org/resource/Heinrich_Ehrlich",
      "http://dbpedia.org/resource/Emil_von_Reznicek",
      "http://dbpedia.org/resource/Luise_Begas-Parmentier",
      "http://dbpedia.org/resource/Adolf_Klein",
      "http://dbpedia.org/resource/Michael_Meinecke",
      "http://dbpedia.org/resource/Marie_von_Buelow",
      "http://dbpedia.org/resource/Irene_Prador",
      "http://dbpedia.org/resource/Steffie_Spira",
      "http://dbpedia.org/resource/Alfred_Halm",
      "http://dbpedia.org/resource/Eduard_von_Winterstein",
      "http://dbpedia.org/resource/Edmund_Meisel",
      "http://dbpedia.org/resource/Hilde_K\u00f6rber",
      "http://dbpedia.org/resource/Eduard_Peithner_von_Lichtenfels",
      "http://dbpedia.org/resource/Friedrich_Leitner",
      "http://dbpedia.org/resource/Tilla_Durieux",
      "http://dbpedia.org/resource/Josef_Rufer",
      "http://dbpedia.org/resource/Therese_Gr\u00fcnbaum",
      "http://dbpedia.org/resource/Fritz_Richard",
      "http://dbpedia.org/resource/Hugo_Flink",
      "http://dbpedia.org/resource/Alexander_Meissner",
      "http://dbpedia.org/resource/Grete_von_Zieritz",
      "http://dbpedia.org/resource/Karl_Etlinger",
      "http://dbpedia.org/resource/Karl_Hellmer",
      "http://dbpedia.org/resource/Mathilde_Danegger",
      "http://dbpedia.org/resource/Robert_Reinert",
      "http://dbpedia.org/resource/Oscar_Sabo",
      "http://dbpedia.org/resource/Rudolf_Walther-Fein",
      "http://dbpedia.org/resource/Willy_Trenk-Trebitsch",
      "http://dbpedia.org/resource/Guido_von_List",
      "http://dbpedia.org/resource/Gerda_Laski",
      "http://dbpedia.org/resource/Karoline_Seidler-Wranitzky",
      "http://dbpedia.org/resource/Hanna_Berger",
      "http://dbpedia.org/resource/Leo_Mittler",
      "http://dbpedia.org/resource/Hans_Fidesser",
      "http://dbpedia.org/resource/Jacob_Taubes",
      "http://dbpedia.org/resource/Viktoria_von_Ballasko",
      "http://dbpedia.org/resource/Richard_Thurnwald",
      "http://dbpedia.org/resource/Helene_Weigel",
      "http://dbpedia.org/resource/Johann_Alexander_Hubler-Kahla",
      "http://dbpedia.org/resource/Johann_Strauss_III",
      "http://dbpedia.org/resource/Robert_Bodanzky"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 179,
    "question": "Is Darth Vader Luke\u2019s father?",
    "answers": [
      true
    ],
    "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Luke_Skywalker> }",
    "answertype": "boolean",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 184,
    "question": "Give me all breeds of the German Shepherd dog.",
    "answers": [
      "http://dbpedia.org/resource/Mancs_(dog)",
      "http://dbpedia.org/resource/Appollo_(dog)",
      "http://dbpedia.org/resource/Blondi",
      "http://dbpedia.org/resource/Lucca_(dog)",
      "http://dbpedia.org/resource/Lightning_(dog)",
      "http://dbpedia.org/resource/Antis_(dog)",
      "http://dbpedia.org/resource/Strongheart",
      "http://dbpedia.org/resource/Nemo_A534"
    ],
    "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 192,
    "question": "Is Cola a beverage?",
    "answers": [
      true
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage }",
    "answertype": "boolean",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 209,
    "question": "Who created Batman?",
    "answers": [
      "http://dbpedia.org/resource/Bob_Kane",
      "http://dbpedia.org/resource/Bill_Finger"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Batman dbo:creator ?uri }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 212,
    "question": "Give me all movies directed by Francis Ford Coppola.",
    "answers": [
      "http://dbpedia.org/resource/The_Rain_People",
      "http://dbpedia.org/resource/The_Godfather_Part_III",
      "http://dbpedia.org/resource/One_from_the_Heart",
      "http://dbpedia.org/resource/The_Outsiders_(film)",
      "http://dbpedia.org/resource/The_Terror_(1963_film)",
      "http://dbpedia.org/resource/The_Godfather_Part_II",
      "http://dbpedia.org/resource/Twixt_(film)",
      "http://dbpedia.org/resource/The_Cotton_Club_(film)",
      "http://dbpedia.org/resource/Tonight_for_Sure",
      "http://dbpedia.org/resource/Peggy_Sue_Got_Married",
      "http://dbpedia.org/resource/Bram_Stoker's_Dracula",
      "http://dbpedia.org/resource/The_Conversation",
      "http://dbpedia.org/resource/Rumble_Fish",
      "http://dbpedia.org/resource/Apocalypse_Now_Redux",
      "http://dbpedia.org/resource/The_Godfather",
      "http://dbpedia.org/resource/Youth_Without_Youth_(film)",
      "http://dbpedia.org/resource/Finian's_Rainbow_(film)",
      "http://dbpedia.org/resource/Dementia_13",
      "http://dbpedia.org/resource/Tucker:_The_Man_and_His_Dream",
      "http://dbpedia.org/resource/Gardens_of_Stone",
      "http://dbpedia.org/resource/The_Rainmaker_(1997_film)",
      "http://dbpedia.org/resource/You're_a_Big_Boy_Now",
      "http://dbpedia.org/resource/Tetro",
      "http://dbpedia.org/resource/New_York_Stories",
      "http://dbpedia.org/resource/The_Godfather_Saga",
      "http://dbpedia.org/resource/The_Godfather_(film_series)",
      "http://dbpedia.org/resource/Battle_Beyond_the_Sun",
      "http://dbpedia.org/resource/The_Bellboy_and_the_Playgirls",
      "http://dbpedia.org/resource/Jack_(1996_film)"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 229,
    "question": "Give me all launch pads operated by NASA.",
    "answers": [
      "http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0",
      "http://dbpedia.org/resource/Keweenaw_Rocket_Range",
      "http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36",
      "http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3",
      "http://dbpedia.org/resource/Broglio_Space_Centre",
      "http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39",
      "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 246,
    "question": "List all the musicals with music by Elton John.",
    "answers": [
      "http://dbpedia.org/resource/The_Lion_King_(musical)",
      "http://dbpedia.org/resource/The_Lion_King_Jr_(musical)",
      "http://dbpedia.org/resource/Billy_Elliot_the_Musical",
      "http://dbpedia.org/resource/Lestat_(musical)",
      "http://dbpedia.org/resource/Aida_(musical)"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 257,
    "question": "Give me the runtime of Toy Story.",
    "answers": [
      "4860.0"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }",
    "answertype": "number",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 270,
    "question": "List the children of Margaret Thatcher.",
    "answers": [
      "http://dbpedia.org/resource/Carol_Thatcher",
      "http://dbpedia.org/resource/Mark_Thatcher"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 280,
    "question": "Give me all actors starring in movies directed by William Shatner.",
    "answers": [
      "http://dbpedia.org/resource/Tom_Towles",
      "http://dbpedia.org/resource/Brenda_Bakke",
      "http://dbpedia.org/resource/William_Shatner",
      "http://dbpedia.org/resource/George_Takei",
      "http://dbpedia.org/resource/John_Prosky",
      "http://dbpedia.org/resource/Duane_Whitaker",
      "http://dbpedia.org/resource/Dick_Van_Patten",
      "http://dbpedia.org/resource/Amy_Acker",
      "http://dbpedia.org/resource/Leonard_Nimoy",
      "http://dbpedia.org/resource/Rickey_Medlocke",
      "http://dbpedia.org/resource/Walter_Koenig",
      "http://dbpedia.org/resource/DeForest_Kelley",
      "http://dbpedia.org/resource/Dan_Martin_(actor)",
      "http://dbpedia.org/resource/Chuck_Williams_(actor)",
      "http://dbpedia.org/resource/J.T._Colosa",
      "http://dbpedia.org/resource/James_Doohan",
      "http://dbpedia.org/resource/Dan_Gauthier",
      "http://dbpedia.org/resource/Nichelle_Nichols"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 284,
    "question": "List all games by GMT.",
    "answers": [
      "http://dbpedia.org/resource/Washington's_War",
      "http://dbpedia.org/resource/Fields_of_Fire_(game)",
      "http://dbpedia.org/resource/Commands_&_Colors:_Ancients",
      "http://dbpedia.org/resource/A_World_At_War",
      "http://dbpedia.org/resource/Sword_of_Rome",
      "http://dbpedia.org/resource/Twilight_Struggle",
      "http://dbpedia.org/resource/Paths_of_Glory_(board_game)",
      "http://dbpedia.org/resource/Chandragupta_(board_game)"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 289,
    "question": "Give me all video games published by Mean Hamster Software.",
    "answers": [
      "http://dbpedia.org/resource/Crossbow_(video_game)",
      "http://dbpedia.org/resource/Riven"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 290,
    "question": "Give me all members of Prodigy.",
    "answers": [
      "http://dbpedia.org/resource/Maxim_(musician)",
      "http://dbpedia.org/resource/Liam_Howlett",
      "http://dbpedia.org/resource/Keith_Flint"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 307,
    "question": "Give me the birth place of Frank Sinatra.",
    "answers": [
      "http://dbpedia.org/resource/Hoboken,_New_Jersey"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 341,
    "question": "Show me all books in Asimov's Foundation series.",
    "answers": [
      "http://dbpedia.org/resource/The_Originist",
      "http://dbpedia.org/resource/Foundation_and_Earth",
      "http://dbpedia.org/resource/Forward_the_Foundation"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 361,
    "question": "Give me the grandchildren of Elvis Presley.",
    "answers": [
      "http://dbpedia.org/resource/Riley_Keough"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 365,
    "question": "Give me all books by William Goldman with more than 300 pages.",
    "answers": [
      "http://dbpedia.org/resource/Marathon_Man_(novel)",
      "http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F",
      "http://dbpedia.org/resource/Hype_and_Glory",
      "http://dbpedia.org/resource/Boys_and_Girls_Together",
      "http://dbpedia.org/resource/Tinsel_(novel)",
      "http://dbpedia.org/resource/Control_(novel)",
      "http://dbpedia.org/resource/The_Color_of_Light",
      "http://dbpedia.org/resource/The_Princess_Bride",
      "http://dbpedia.org/resource/Wait_Till_Next_Year",
      "http://dbpedia.org/resource/Brothers_(Goldman_novel)"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 377,
    "question": "Show me the book that Muhammad Ali wrote.",
    "answers": [
      "http://dbpedia.org/resource/The_Greatest:_My_Own_Story",
      "http://dbpedia.org/resource/The_Soul_of_a_Butterfly"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 385,
    "question": "Show me Hemingway's autobiography.",
    "answers": [
      "http://dbpedia.org/resource/A_Moveable_Feast"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 388,
    "question": "Give me all Canadian Grunge record labels.",
    "answers": [
      "http://dbpedia.org/resource/Murderecords"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 396,
    "question": "Give me the currency of China.",
    "answers": [
      "http://dbpedia.org/resource/Renminbi"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:China dbo:currency ?uri }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 397,
    "question": "Give me all Swedish oceanographers.",
    "answers": [
      "http://dbpedia.org/resource/Vagn_Walfrid_Ekman"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  },
  {
    "id": 406,
    "question": "Give me all actors starring in Last Action Hero.",
    "answers": [
      "http://dbpedia.org/resource/Tom_Noonan",
      "http://dbpedia.org/resource/F._Murray_Abraham",
      "http://dbpedia.org/resource/Arnold_Schwarzenegger",
      "http://dbpedia.org/resource/Mercedes_Ruehl",
      "http://dbpedia.org/resource/Charles_Dance",
      "http://dbpedia.org/resource/Art_Carney",
      "http://dbpedia.org/resource/Frank_McRae",
      "http://dbpedia.org/resource/Austin_O'Brien",
      "http://dbpedia.org/resource/Robert_Prosky",
      "http://dbpedia.org/resource/Anthony_Quinn"
    ],
    "sparql_query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }",
    "answertype": "resource",
    "aggregation": false,
    "onlydbo": true,
    "hybrid": false
  }
]